### 연습 문제 4.1.1
<pre>
(1) 임의로 두 개의 시리즈 객체를 만든다. 
모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.

(2) 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.
</pre>

In [3]:
import numpy as np
import pandas as pd

In [8]:
df1 = pd.Series([1,2,3,4,5,6],['서울','부산','인천','대구','대전','광주'])
df2 = pd.Series([2,4,6,8,10,12],['서울','부산','인천','대구','대전','광주'])

In [9]:
df1 , df2

(서울    1
 부산    2
 인천    3
 대구    4
 대전    5
 광주    6
 dtype: int64,
 서울     2
 부산     4
 인천     6
 대구     8
 대전    10
 광주    12
 dtype: int64)

In [12]:
df1+df2 ,df1-df2,df1*df2,df1/df2

(서울     3
 부산     6
 인천     9
 대구    12
 대전    15
 광주    18
 dtype: int64,
 서울   -1
 부산   -2
 인천   -3
 대구   -4
 대전   -5
 광주   -6
 dtype: int64,
 서울     2
 부산     8
 인천    18
 대구    32
 대전    50
 광주    72
 dtype: int64,
 서울    0.5
 부산    0.5
 인천    0.5
 대구    0.5
 대전    0.5
 광주    0.5
 dtype: float64)

### 연습 문제 4.1.2
<pre>
다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.

(1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.

(2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.
</pre>

In [16]:
data={
    '서울': [5555,555,0.555,9988,'특별시'],
    '부산': [4444,444,0.444,7766,'광역시'],
    '인천': [3333,333,0.333,5544,'광역시'],
    '대구': [2222,222,0.222,3322,'광역시'],
    '대전': [1111,111,0.111,1100,'광역시']
}
df = pd.DataFrame(data, index = ['1행','2행','3행','4행','5행'])
df

       서울     부산     인천     대구     대전
1행   5555   4444   3333   2222   1111
2행    555    444    333    222    111
3행  0.555  0.444  0.333  0.222  0.111
4행   9988   7766   5544   3322   1100
5행    특별시    광역시    광역시    광역시    광역시

In [17]:
df.index

Index(['1행', '2행', '3행', '4행', '5행'], dtype='object')

In [18]:
df.T

      1행   2행     3행    4행   5행
서울  5555  555  0.555  9988  특별시
부산  4444  444  0.444  7766  광역시
인천  3333  333  0.333  5544  광역시
대구  2222  222  0.222  3322  광역시
대전  1111  111  0.111  1100  광역시

### 연습 문제 4.1.3
<pre>
다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
(1) 모든 학생의 수학 점수를 시리즈로 나타낸다.

(2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.

(3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

(4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.

(5) 춘향의 점수를 데이터프레임으로 나타낸다.

(6) 향단의 점수를 시리즈로 나타낸다.
</pre>

In [20]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

In [21]:
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [22]:
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [28]:
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [31]:
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df['평균'] = df.mean(axis=1)
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [32]:
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [34]:
# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df['영어'] = 80
del df['평균']
df['평균'] = df.mean(axis=1)
df

    국어  영어  수학         평균
춘향  80  80  90  83.333333
몽룡  90  80  60  76.666667
향단  70  80  80  76.666667
방자  30  80  70  60.000000

In [44]:
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
df[:1]

    국어  영어  수학         평균
춘향  80  80  90  83.333333

In [48]:
# (6) 향단의 점수를 시리즈로 나타낸다.
df.loc['향단']

국어    70.000000
영어    80.000000
수학    80.000000
평균    76.666667
Name: 향단, dtype: float64

### 연습 문제 4.3.1

모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.

10가지 이상의 방법으로 특정한 행과 열을 선택한다.

In [54]:
np.random.seed(2022)
df5 = pd.DataFrame(np.random.randint(40,101,25).reshape(5,5),
                   columns = ['국어1','영어1','수학1','사회1','과학1'],
                   index = ['춘향2','몽룡2','향단2','방자2','사또2'])
df5

     국어1  영어1  수학1  사회1  과학1
춘향2   68   85   88   89   89
몽룡2   88   95   64   58   64
향단2   56   93   81   73   67
방자2   51   59   70   80   51
사또2   88   59   78   48   54

In [81]:
# 향단의 사회 점수  73
print(df5['사회1']['향단2'])
print(df5['사회1'].향단2)
print(df5.사회1.향단2)
print(df5['사회1'][2])
print(df5.loc['향단2']['사회1'])
print(df5.loc['향단2'][3])
print(df5.loc['향단2'].사회1)
print(df5.loc['향단2'][-2])
print(df5.iloc[2,3])
print(df5.iloc[2][3])
print(df5.iloc[2].사회1)

73
73
73
73
73
73
73
73
73
73
73